#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/loktf/terraform/runs/run-YpaKg7GWXoaEXa4F

Waiting for the plan to start...

Terraform v0.14.8
Configuring remote state backend...
Initializing Terraform configuration...
azurerm_resource_group.rg: Refreshing state... [id=/subscriptions/eab04c08-63fc-4336-909a-e1b7f7d8ca1e/resourceGroups/TFCloudRG]
random_id.randomId: Refreshing state... [id=mYvuJ1trbGI]
azurerm_virtual_network.vnet: Refreshing state... [id=/subscriptions/eab04c08-63fc-4336-909a-e1b7f7d8ca1e/resourceGroups/TFCloudRG/providers/Microsoft.Network/virtualNetworks/vnet-tf]
azurerm_public_ip.pip: Refreshing state... [id=/subscriptions/eab04c08-63fc-4336-909a-e1b7f7d8ca1e/resourceGroups/TFCloudRG/providers/Microsoft.Network/publicIPAddresses/myPublicIP]
azurerm_network_security_group.nsg: Refreshing state... [id=/subscriptions/eab04c08-63fc-4336-909a-e1b7f7d8ca1e/resourceGroups/TFCloudRG/providers/Microsoft.Network/networkSecurityGroups/TFC_NSG]
azurerm_subnet.subnet: Refreshing state... [id=/subscriptions/eab04c08-63fc-4336-909a-e1b7f7d8ca1e/resourceGroups/TFCloudRG/providers/Microsoft.Network/virtualNetworks/vnet-tf/subnets/subnet01]
azurerm_network_interface.nic: Refreshing state... [id=/subscriptions/eab04c08-63fc-4336-909a-e1b7f7d8ca1e/resourceGroups/TFCloudRG/providers/Microsoft.Network/networkInterfaces/myNIC]
azurerm_network_interface_security_group_association.ngsa: Refreshing state... [id=/subscriptions/eab04c08-63fc-4336-909a-e1b7f7d8ca1e/resourceGroups/TFCloudRG/providers/Microsoft.Network/networkInterfaces/myNIC|/subscriptions/eab04c08-63fc-4336-909a-e1b7f7d8ca1e/resourceGroups/TFCloudRG/providers/Microsoft.Network/networkSecurityGroups/TFC_NSG]
azurerm_linux_virtual_machine.myterraformvm: Refreshing state... [id=/subscriptions/eab04c08-63fc-4336-909a-e1b7f7d8ca1e/resourceGroups/TFCloudRG/providers/Microsoft.Compute/virtualMachines/TFCloudVM]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine.myterraformvm will be created
  + resource "azurerm_linux_virtual_machine" "myterraformvm" {
      + admin_password                  = (sensitive value)
      + admin_username                  = "adminuser"
      + allow_extension_operations      = true
      + computer_name                   = "myvm"
      + disable_password_authentication = false
      + extensions_time_budget          = "PT1H30M"
      + id                              = (known after apply)
      + location                        = "westeurope"
      + max_bid_price                   = -1
      + name                            = "TFCloudVM"
      + network_interface_ids           = (known after apply)
      + platform_fault_domain           = -1
      + priority                        = "Regular"
      + private_ip_address              = (known after apply)
      + private_ip_addresses            = (known after apply)
      + provision_vm_agent              = true
      + public_ip_address               = (known after apply)
      + public_ip_addresses             = (known after apply)
      + resource_group_name             = "TFCloudRG"
      + size                            = "Standard_B1s"
      + tags                            = {
          + "environment" = "Terraform Cloud Demo"
        }
      + virtual_machine_id              = (known after apply)
      + zone                            = (known after apply)

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = "myOsDisk"
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "18.04-LTS"
          + version   = "latest"
        }
    }

  # azurerm_network_interface.nic will be created
  + resource "azurerm_network_interface" "nic" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "westeurope"
      + mac_address                   = (known after apply)
      + name                          = "myNIC"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "TFCloudRG"
      + tags                          = {
          + "environment" = "Terraform Cloud Demo"
        }
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + name                          = "myNicConfiguration"
          + primary                       = (known after apply)
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = "dynamic"
          + private_ip_address_version    = "IPv4"
          + public_ip_address_id          = (known after apply)
          + subnet_id                     = (known after apply)
        }
    }

  # azurerm_network_interface_security_group_association.ngsa will be created
  + resource "azurerm_network_interface_security_group_association" "ngsa" {
      + id                        = (known after apply)
      + network_interface_id      = (known after apply)
      + network_security_group_id = (known after apply)
    }

  # azurerm_network_security_group.nsg will be created
  + resource "azurerm_network_security_group" "nsg" {
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "TFC_NSG"
      + resource_group_name = "TFCloudRG"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = ""
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "22"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "SSH"
              + priority                                   = 1001
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
        ]
      + tags                = {
          + "environment" = "Terraform Cloud Demo"
        }
    }

  # azurerm_public_ip.pip will be created
  + resource "azurerm_public_ip" "pip" {
      + allocation_method       = "Dynamic"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "westeurope"
      + name                    = "myPublicIP"
      + resource_group_name     = "TFCloudRG"
      + sku                     = "Basic"
      + tags                    = {
          + "environment" = "Terraform Cloud Demo"
        }
    }

  # azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "TFCloudRG"
    }

  # azurerm_subnet.subnet will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "subnet01"
      + resource_group_name                            = "TFCloudRG"
      + virtual_network_name                           = "vnet-tf"
    }

  # azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space         = [
          + "10.0.0.0/16",
        ]
      + guid                  = (known after apply)
      + id                    = (known after apply)
      + location              = "westeurope"
      + name                  = "vnet-tf"
      + resource_group_name   = "TFCloudRG"
      + subnet                = (known after apply)
      + tags                  = {
          + "environment" = "Terraform Cloud Demo"
        }
      + vm_protection_enabled = false
    }

Plan: 8 to add, 0 to change, 0 to destroy.
```
</details>
*Pusher: @lokpavan03, Action: `pull_request`*